Revit 2027 API
ParameterTypeId.StructuralAttachmentStartType Property
 "Start Attachment Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAttachmentStartType { get; }
Public Shared ReadOnly Property StructuralAttachmentStartType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAttachmentStartType {
	ForgeTypeId^ get ();
}
static member StructuralAttachmentStartType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace